**Ejercicio 5**

Escribir una funci√≥n que reciba un DataFrame con el formato del ejercicio anterior, una lista de meses, y devuelva el balance (ventas - gastos) total en los meses indicados.

In [1]:
import pandas as pd

In [25]:
def encontrar_balance(dataframe, lista_meses):
    dataframe['Balance'] = dataframe.Ventas-dataframe.Gastos
    df2 = dataframe[dataframe.Mes.isin(lista_meses)]
    return df2.loc[:,['Mes','Balance']]

In [22]:
datos = {
    'Mes':['Enero','Febrero','Marzo','Abril','Mayo','Junio','Julio','Agosto','Septiembre','Octubre','Noviembre','Diciembre'],
    'Ventas':[30500,35600,28300,33900,45000,23800,75000,54200,9600,12000,33500,49000],
    'Gastos':[22000,23400,18100,20700,5000,12000,4500,6500,5000,4200,1300,1000]
}
df = pd.DataFrame(datos)
df.head(12)

           Mes  Ventas  Gastos
0        Enero   30500   22000
1      Febrero   35600   23400
2        Marzo   28300   18100
3        Abril   33900   20700
4         Mayo   45000    5000
5        Junio   23800   12000
6        Julio   75000    4500
7       Agosto   54200    6500
8   Septiembre    9600    5000
9      Octubre   12000    4200
10   Noviembre   33500    1300
11   Diciembre   49000    1000

In [28]:
encontrar_balance(df, ['Enero','Febrero','Marzo','Junio','Diciembre'])

          Mes  Balance
0       Enero     8500
1     Febrero    12200
2       Marzo    10200
5       Junio    11800
11  Diciembre    48000